[
    {
        "id": "1baae3b2-4047-4d4d-a33f-e46e1e9cfe71",
        "titulo": "Davi e o Gigante Golias",
        "texto": "Era uma vez um menino chamado Davi que cuidava das ovelhas do pai. Todo dia ele tocava harpa e cantava louvores a Deus. Um dia apareceu o gigante Golias, quase três metros de altura, com uma armadura pesada e uma lança enorme. Ele gritava desafiando o exército de Israel. Todos tinham medo, até o rei Saul. Davi chegou para levar comida aos irmãos e ouviu os insultos do gigante. Indignado disse: “Quem é esse filisteu para desafiar o exército do Deus vivo?”. Davi se ofereceu para lutar. O rei tentou colocar nele sua armadura, mas era grande demais. Davi tirou tudo, pegou apenas sua funda e cinco pedrinhas lisas do riacho. Golias riu: “Sou eu um cão para vires com pedras?”. Davi respondeu cheio de coragem: “Tu vens a mim com espada e lança, mas eu vou em nome do Senhor dos Exércitos!”. Girou a funda e a pedra acertou exatamente na testa do gigante. Golias caiu morto! O exército de Israel comemorou a vitória. Davi nos ensina que não importa o tamanho do problema, quando confiamos em Deus, Ele nos dá força e vitória! E assim, o pequeno Davi se tornou um grande herói na história de todos os tempos. As crianças podem aprender que Deus usa os humildes para mostrar Seu poder. Imagine você enfrentando um 'gigante' na escola ou em casa – com fé, Deus te ajuda a vencer!",
        "duracao_estimada": "3 min",
        "caminho_audio": "audios/01_davi_e_o_gigante_golias.wav",
        "url_imagem_capa": "https://placehold.co/1080x1920/4a90e2/ffffff/png?text=Davi+e+o+Gigante+Golias&font=montserrat",
        "duracao_segundos": 108,
        "duracao_formatada": "01:48"
    },
    {
        "id": "1611f8e1-eb42-4f57-9be3-50e0da6475cd",
        "titulo": "A Arca de Noé e o Dilúvio",
        "texto": "Há muito tempo as pessoas só faziam coisas ruins e Deus ficou triste. Mas havia um homem chamado Noé que andava com Deus. Deus avisou que mandaria um grande dilúvio e mandou Noé construir uma arca gigantesca. Noé obedeceu e trabalhou mais de cem anos com seus filhos Sem, Cam e Jafé. A arca tinha três andares e uma porta só. Deus mandou entrar sete pares de animais limpos e um casal dos outros: elefantes, girafas, leõezinhos, coelhinhos, até dinossauros bebês entraram! Quando todos estavam dentro, Deus fechou a porta. Choveu quarenta dias e quarenta noites sem parar. A água cobriu até as montanhas mais altas. Dentro da arca Noé cuidava de todos com carinho. Depois de muitos meses a água baixou. Noé soltou uma pomba e na terceira vez ela voltou com um raminho verde no bico. Era sinal de terra seca! Quando saíram, a primeira coisa que Noé fez foi construir um altar para agradecer a Deus. Deus colocou um lindo arco-íris no céu prometendo nunca mais destruir a terra com água. Até hoje o arco-íris nos lembra do amor e da promessa de Deus. As crianças podem olhar para o céu depois da chuva e lembrar da fidelidade de Deus. Obedecer a Deus sempre traz proteção, como trouxe para Noé e sua família!",
        "duracao_estimada": "3 min",
        "caminho_audio": "audios/02_a_arca_de_noé_e_o_dilúvio.wav",
        "url_imagem_capa": "https://placehold.co/1080x1920/87CEEB/ffffff/png?text=A+Arca+de+Noé+e+o+Dilúvio&font=montserrat",
        "duracao_segundos": 92,
        "duracao_formatada": "01:32"
    },
    {
        "id": "ab16a9be-fab1-4b90-ace0-9b956ac36296",
        "titulo": "Daniel na Cova dos Leões",
        "texto": "Daniel amava orar três vezes por dia. Homens invejosos convenceram o rei Dario a fazer uma lei proibindo orar a qualquer deus. Daniel continuou orando como sempre. Os inimigos o denunciaram e o rei, mesmo triste, teve que jogar Daniel na cova dos leões famintos. O rei passou a noite sem dormir. De madrugada correu até a cova e gritou: “Daniel, teu Deus te salvou?”. Para surpresa de todos, Daniel respondeu: “Ó rei, vive para sempre! Meu Deus enviou seu anjo e fechou a boca dos leões!”. O rei mandou tirar Daniel e jogou os homens maus na cova. Os leões os devoraram num instante. Então o rei escreveu para todo o reino: “Todos devem temer o Deus de Daniel, porque Ele é o Deus vivo que faz milagres!”. Daniel continuou servindo a Deus com alegria. Essa história nos mostra que Deus nunca abandona quem é fiel a Ele. As crianças podem orar todos os dias sabendo que Deus ouve e protege como protegeu Daniel. Mesmo quando amigos tentam nos impedir de orar, como Daniel, sejamos corajosos! Deus fecha a boca dos 'leões' da nossa vida, como bullying ou medo.",
        "duracao_estimada": "3 min",
        "caminho_audio": "audios/03_daniel_na_cova_dos_leões.wav",
        "url_imagem_capa": "https://placehold.co/1080x1920/FFD700/000000/png?text=Daniel+na+Cova+dos+Leões&font=montserrat",
        "duracao_segundos": 82,
        "duracao_formatada": "01:22"
    },
    {
        "id": "4b2bdcbc-36b5-4f06-90e3-278f6e9fa08b",
        "titulo": "Jonas e o Grande Peixe",
        "texto": "Deus mandou Jonas ir a Nínive avisar que a cidade seria destruída por causa do pecado. Jonas fugiu de navio para o lado oposto. Deus mandou uma tempestade terrível. Os marinheiros descobriram que a culpa era de Jonas e o jogaram no mar. Um peixe enorme engoliu Jonas vivo! Dentro da barriga escura Jonas orou arrependido por três dias. Deus mandou o peixe vomitar Jonas na praia. Jonas foi a Nínive gritando: “Daqui a quarenta dias Nínive será destruída!”. O povo, até o rei, se arrependeu, jejuou e vestiu pano de saco. Deus teve compaixão e não destruiu a cidade. Jonas ficou bravo, mas Deus ensinou que Ele ama todos os povos e quer que todos se arrependam. Jonas aprendeu que ninguém pode fugir de Deus e que o amor de Deus é maior que tudo. As crianças podem aprender que Deus sempre dá uma segunda chance quando nos arrependemos de verdade. Se você fugir de uma tarefa que Deus te deu, como ajudar em casa, volte e obedeça – Deus te perdoa como perdoou Jonas!",
        "duracao_estimada": "3 min",
        "caminho_audio": "audios/04_jonas_e_o_grande_peixe.wav",
        "url_imagem_capa": "https://placehold.co/1080x1920/4682B4/ffffff/png?text=Jonas+e+o+Grande+Peixe&font=montserrat",
        "duracao_segundos": 91,
        "duracao_formatada": "01:31"
    },
    {
        "id": "cfc4fd90-81c7-4247-bd19-011d5cd1edc5",
        "titulo": "A Criação do Mundo",
        "texto": "No começo só havia escuridão. Deus disse: “Haja luz!” e houve dia e noite. No segundo dia fez o céu. No terceiro separou água da terra, fez mares e plantas. No quarto colocou sol, lua e estrelas. No quinto criou peixes e aves. No sexto fez animais e o homem e a mulher à Sua imagem. Deus olhou tudo e disse: “É muito bom!”. No sétimo dia descansou e abençoou esse dia. Tudo era perfeito no jardim do Éden. Adão e Eva andavam com Deus à tardinha. Não havia doença nem tristeza. Deus deu a eles o jardim cheio de frutas gostosas e animais amigos. A única regra era não comer da árvore do conhecimento do bem e do mal. Essa história nos mostra que o mundo não surgiu por acaso: Deus pensou em cada detalhe com amor pra gente ser feliz! As crianças podem olhar para a natureza e agradecer a Deus pelo lindo mundo que Ele criou. Cada flor, cada pássaro é um presente de Deus – vamos cuidar bem dele!",
        "duracao_estimada": "3 min",
        "caminho_audio": "audios/05_a_criação_do_mundo.wav",
        "url_imagem_capa": "https://placehold.co/1080x1920/228B22/ffffff/png?text=A+Criação+do+Mundo&font=montserrat",
        "duracao_segundos": 81,
        "duracao_formatada": "01:21"
    },
    {
        "id": "e76f98d8-a448-4ad1-a527-02e842a1ec15",
        "titulo": "Os Cinco Pães e Dois Peixes",
        "texto": "Jesus ensinava numa montanha e mais de cinco mil pessoas foram ouvir. Quando anoiteceu todos ficaram com fome. Os discípulos queriam mandar o povo embora. Jesus perguntou: “O que temos?”. André respondeu: “Um menino tem cinco pães e dois peixinhos, mas o que é isso pra tanta gente?”. Jesus mandou o povo sentar na grama, agradeceu a Deus e começou a partir os pães. Os discípulos distribuíam e os pães não acabavam! Os peixes também multiplicavam. Todo mundo comeu até ficar satisfeito e ainda sobraram doze cestos cheios. O menino ficou maravilhado. Ele poderia ter escondido o lanche, mas escolheu compartilhar. Jesus mostrou que quando colocamos nas mãos Dele o pouco que temos, Ele multiplica e transforma em bênção pra muita gente. As crianças podem compartilhar seus brinquedos sabendo que Deus abençoa quem é generoso. Seu lanche pequeno pode virar uma festa grande nas mãos de Jesus!",
        "duracao_estimada": "3 min",
        "caminho_audio": "audios/06_os_cinco_pães_e_dois_peixes.wav",
        "url_imagem_capa": "https://placehold.co/1080x1920/FF8C00/ffffff/png?text=Os+Cinco+Pães+e+Dois+Peixes&font=montserrat",
        "duracao_segundos": 65,
        "duracao_formatada": "01:05"
    },
    {
        "id": "454d6526-9c1b-419b-8f19-e0cb9b9ea222",
        "titulo": "Jesus Acalma a Tempestade",
        "texto": "Jesus e os discípulos entraram num barquinho para atravessar o mar. Jesus dormiu. De repente veio uma tempestade terrível! Ondas gigantes e vento forte. Os discípulos gritaram: “Vamos morrer!”. Acordaram Jesus apavorados. Jesus levantou, olhou para o mar e disse: “Aquietai-vos!”. Na mesma hora o vento parou e o mar ficou calmo. Os discípulos ficaram de boca aberta: “Quem é este que até o vento e o mar obedecem?”. Jesus perguntou: “Por que tanto medo? Ainda não têm fé?”. Naquela noite eles aprenderam que Jesus tem poder sobre tudo. Quando vier tempestade na nossa vida, podemos chamar por Jesus, porque Ele está no nosso barquinho e nunca dorme de verdade quando precisamos. As crianças podem orar nas horas difíceis sabendo que Jesus acalma as tempestades do coração. Seja chuva forte ou medo de prova, Jesus diz: 'Fiquem calmos!'",
        "duracao_estimada": "3 min",
        "caminho_audio": "audios/07_jesus_acalma_a_tempestade.wav",
        "url_imagem_capa": "https://placehold.co/1080x1920/191970/ffffff/png?text=Jesus+Acalma+a+Tempestade&font=montserrat",
        "duracao_segundos": 84,
        "duracao_formatada": "01:24"
    },
    {
        "id": "5f652db0-2469-4069-84f2-fd76fc5f1dde",
        "titulo": "O Bom Samaritano",
        "texto": "Jesus contou: Um homem descia de Jerusalém para Jericó e foi assaltado. Ficou quase morto na estrada. Passou um sacerdote, viu e atravessou para o outro lado. Passou um levita, viu e também passou longe. Por fim passou um samaritano, teve compaixão, fez curativo com óleo e vinho, colocou o homem no seu jumento e levou para uma hospedaria. Pagou tudo e disse: “Cuide dele; na volta pagarei mais”. Jesus perguntou: “Qual foi o próximo do ferido?”. Responderam: “O que usou de misericórdia”. Jesus disse: “Vá e faça o mesmo”. Nosso próximo é todo mundo que precisa de ajuda, não importa quem seja. Deus quer que tenhamos coração de samaritano. As crianças podem ajudar os amigos na escola mostrando amor ao próximo. Se alguém cair no recreio, levante como o samaritano!",
        "duracao_estimada": "3 min",
        "caminho_audio": "audios/08_o_bom_samaritano.wav",
        "url_imagem_capa": "https://placehold.co/1080x1920/DC143C/ffffff/png?text=O+Bom+Samaritano&font=montserrat",
        "duracao_segundos": 62,
        "duracao_formatada": "01:02"
    },
    {
        "id": "c1a39028-ffb7-4548-b928-d370472190df",
        "titulo": "O Filho Pródigo",
        "texto": "Um filho pediu a herança ao pai e foi embora. Gastou tudo com festas. Veio fome na terra e ele passou necessidade. Cuidava de porcos e queria comer as bolotas deles. Pensou: “Na casa do meu pai até os empregados têm pão!”. Voltou arrependido. Ainda de longe o pai correu, abraçou e beijou o filho sujo. O filho disse: “Pequei contra o céu e contra ti…”. O pai nem deixou terminar: “Tragam a melhor roupa, anel e sandálias! Matem o novilho gordo! Meu filho estava perdido e foi achado!”. O irmão mais velho ficou bravo, mas o pai disse: “Precisamos festejar porque teu irmão voltou!”. Deus é assim: corre ao nosso encontro quando nos arrependemos. As crianças podem saber que Deus sempre perdoa quando voltamos para Ele. Se você brigar com um irmão, volte e peça perdão – o pai celestial te abraça!",
        "duracao_estimada": "3 min",
        "caminho_audio": "audios/09_o_filho_pródigo.wav",
        "url_imagem_capa": "https://placehold.co/1080x1920/8B4513/ffffff/png?text=O+Filho+Pródigo&font=montserrat",
        "duracao_segundos": 75,
        "duracao_formatada": "01:15"
    },
    {
        "id": "7d75a81a-340f-4eab-adec-e9e573104654",
        "titulo": "O Nascimento de Jesus",
        "texto": "O imperador mandou contar todo mundo. José e Maria, grávida, foram a Belém. Não tinha lugar na hospedaria. Só acharam uma gruta onde guardavam animais. Ali nasceu o Menino Jesus. Maria envolveu-o em faixas e deitou numa manjedoura. Na mesma noite anjos apareceram aos pastores: “Nasceu o Salvador na cidade de Davi! Encontrareis o menino na manjedoura”. O céu se encheu de anjos cantando “Glória a Deus nas alturas!”. Os pastores correram e encontraram tudo como o anjo disse. Uma estrela guiou três reis magos até a casinha com ouro, incenso e mirra. Naquela noite simples, Deus se fez criança para nos mostrar que o amor veio ao mundo. Jesus nasceu para todo aquele que nEle crer tenha vida eterna. As crianças podem celebrar o Natal lembrando do amor de Deus que veio como bebê. Cante 'Noite Feliz' e agradeça pelo melhor presente: Jesus!",
        "duracao_estimada": "3 min",
        "caminho_audio": "audios/10_o_nascimento_de_jesus.wav",
        "url_imagem_capa": "https://placehold.co/1080x1920/FFD700/000080/png?text=O+Nascimento+de+Jesus&font=montserrat",
        "duracao_segundos": 73,
        "duracao_formatada": "01:13"
    }

]