[
    {
        "id": 1,
        "title": "A Criação do Mundo",
        "bibleRef": "Gênesis 1",
        "cover": "https://images.unsplash.com/photo-1451187580459-43490279c0fa?auto=format&fit=crop&w=500&q=80",
        "duration": "5 min",
        "content": [
            "Você consegue imaginar um mundo onde não existia nada? Nem luz, nem cores, nem som? Tudo era muito escuro.",
            "Mas Deus tinha um plano maravilhoso! Ele disse: 'Que haja luz!', e de repente, tudo se iluminou. Ele chamou a luz de Dia e o escuro de Noite.",
            "Deus continuou criando coisas incríveis. Ele pintou o céu de azul, encheu os oceanos de água e cobriu a terra com grama verdinha e árvores cheias de frutas.",
            "Depois, Ele criou o Sol para nos aquecer e a Lua e as estrelas para brilharem à noite como diamantes no céu.",
            "Os mares se encheram de peixes e o céu de pássaros cantando. A terra recebeu leões, cachorrinhos, girafas e todos os bichinhos!",
            "Por último, Deus fez sua criação mais especial: VOCÊ! Ele criou as pessoas para serem amigas d'Ele.",
            "No sétimo dia, Deus olhou para tudo, sorriu e descansou. O mundo estava pronto e era lindo!"
        ],
        "illustration": "🌈"
    },
    {
        "id": 2,
        "title": "A Grande Arca de Noé",
        "bibleRef": "Gênesis 6-9",
        "cover": "https://img.freepik.com/free-vector/noah-ark-with-animals-nature-scene_1308-41764.jpg",
        "duration": "7 min",
        "content": [
            "Noé era um homem muito bondoso que amava a Deus. Mas as outras pessoas do mundo estavam fazendo coisas muito ruins e brigando o tempo todo.",
            "Deus ficou triste, mas decidiu salvar Noé. Ele disse: 'Noé, construa um barco gigante! Vou mandar muita chuva para limpar a terra.'",
            "As pessoas riram de Noé, pois não chovia há muito tempo! Mas Noé obedeceu. Ele martelou a madeira: TOC, TOC, TOC! E construiu uma arca enorme.",
            "Então, os animais começaram a chegar! Dois leões, dois elefantes, dois macaquinhos... Todos entraram na arca junto com a família de Noé.",
            "De repente: BUM! TROVÃO! A chuva caiu por 40 dias e 40 noites. A água cobriu tudo, até as montanhas, mas a arca flutuava segura.",
            "Quando a chuva parou, Noé soltou uma pombinha. Ela voltou com uma folha no bico! A terra estava seca!",
            "Ao saírem, viram um lindo Arco-Íris no céu. Era a promessa de Deus de que nunca mais haveria um dilúvio assim."
        ],
        "illustration": "🌧️"
    },
    {
        "id": 3,
        "title": "O Pequeno Valente Davi",
        "bibleRef": "1 Samuel 17",
        "cover": "https://img.freepik.com/premium-photo/david-goliath-biblical-story-generative-ai_438099-13007.jpg",
        "duration": "6 min",
        "content": [
            "Davi era apenas um menino que cuidava de ovelhinhas no campo. Ele não parecia um soldado forte, mas adorava tocar sua harpa e cantar para Deus.",
            "Um dia, um gigante malvado chamado Golias apareceu. Ele era enorme, forte e usava uma armadura brilhante! Todos os soldados fugiram de medo.",
            "Mas Davi não teve medo. Ele disse: 'Vocês vêm com espadas, mas eu vou em nome de Deus!'.",
            "Davi não usou espada nem armadura pesada. Ele foi até o riacho, pegou 5 pedrinhas lisinhas e sua funda (um estilingue).",
            "Golias riu de Davi: 'Você é só uma criança!'. Mas Davi girou sua funda... ZUM! A pedra voou e acertou bem na testa do gigante!",
            "O gigante caiu no chão! CABUM! O pequeno menino venceu porque confiou que Deus era sua força.",
            "Lembre-se: Com Deus ao seu lado, você pode vencer qualquer medo gigante!"
        ],
        "illustration": "🛡️"
    },
    {
        "id": 4,
        "title": "Jonas e o Grande Peixe",
        "bibleRef": "Jonas 1-3",
        "cover": "https://img.freepik.com/premium-photo/prophet-jonah-whale-generative-ai_958167-27209.jpg",
        "duration": "5 min",
        "content": [
            "Deus pediu para Jonas ir até uma cidade chamada Nínive falar do amor d'Ele. Mas Jonas ficou com medo e fugiu para o lado contrário!",
            "Ele entrou em um barco para fugir. Mas Deus mandou uma tempestade muito forte. O barco balançava para lá e para cá!",
            "Jonas sabia que era culpa dele por desobedecer. Ele foi jogado no mar e a tempestade parou.",
            "Mas Jonas não se afogou. Deus mandou uma baleia gigante (um grande peixe) que engoliu Jonas inteiro! GLUP!",
            "Jonas ficou na barriga do peixe por 3 dias. Lá dentro era escuro, e Jonas orou pedindo perdão a Deus.",
            "Deus ouviu Jonas e mandou o peixe cuspi-lo na praia. Argh!",
            "Jonas aprendeu a lição. Ele correu para Nínive e obedeceu a Deus. Todos ficaram felizes!"
        ],
        "illustration": "🐋"
    },
    {
        "id": 5,
        "title": "O Nascimento de Jesus",
        "bibleRef": "Lucas 2",
        "cover": "https://img.freepik.com/premium-photo/nativity-scene-generative-ai_438099-11449.jpg",
        "duration": "6 min",
        "content": [
            "Há muito tempo, o anjo Gabriel visitou Maria e disse que ela teria um bebê muito especial: o Filho de Deus!",
            "Maria e seu marido José tiveram que viajar para Belém. A cidade estava cheia e não havia quartos nos hotéis.",
            "Eles encontraram um lugarzinho simples, onde os animais dormiam (um estábulo). Foi lá que Jesus nasceu!",
            "Maria enrolou o bebê em paninhos e o colocou na manjedoura (a caixinha onde os animais comem).",
            "No céu, uma estrela muito brilhante apareceu! Anjos cantaram para os pastores no campo: 'Glória a Deus nas alturas!'.",
            "Pastores e reis magos vieram visitar o bebê Jesus e trouxeram presentes.",
            "Foi o primeiro Natal! O dia em que o maior presente de Deus chegou ao mundo."
        ],
        "illustration": "🌟"
    },
    {
        "id": 6,
        "title": "Jesus Acalma a Tempestade",
        "bibleRef": "Marcos 4",
        "cover": "https://img.freepik.com/premium-photo/jesus-calms-storm-generative-ai_927958-375.jpg",
        "duration": "4 min",
        "content": [
            "Um dia, Jesus e seus amigos entraram em um barco para atravessar o lago. Jesus estava cansado e dormiu na parte de trás do barco.",
            "De repente, o céu ficou escuro e o vento começou a soprar forte. VUUUU! As ondas ficaram gigantes e entravam no barco!",
            "Os amigos de Jesus ficaram com muito medo. 'Vamos afundar!', eles gritaram. 'Jesus, acorde, nos ajude!'",
            "Jesus acordou, olhou para a tempestade e disse com voz forte: 'Silêncio! Acalme-se!'.",
            "Na mesma hora, o vento parou e o lago ficou calminho, como um espelho.",
            "Os amigos ficaram impressionados. 'Quem é este homem que até o vento e o mar obedecem?'.",
            "Jesus cuida de nós, mesmo quando as coisas parecem assustadoras!"
        ],
        "illustration": "⛵"
    }
]